# 4. Реализуйте базовый класс Car.
# у класса должны быть следующие атрибуты: speed, color, name, is_police(булево). А также методы: go, stop, turn(direction),
# которые должны сообщать, что машина поехала, остановилась, повернула (куда);
# опишите несколько дочерних классов: TownCar, SportCar, WorkCar, PoliceCar;
# добавьте в базовый класс метод show_speed, который должен показывать текущую скорость автомобиля;
# для классов TownCar и WorkCar переопределите метод show_speed. При значении скорости свыше 60 (TownCar) и 40 (WorkCar)
# должно выводиться сообщение о превышении скорости.
#
# Создайте экземпляры классов, передайте значения атрибутов. Выполните доступ к атрибутам, выведите результат. Вызовите
# методы и покажите результат.
class Car:

    def __init__(self, speed, color, name, is_police):
        self.speed = speed
        self.color = color
        self.name = name
        self.is_police = is_police

    def go(self):
        print('машина поехала')

    def stop(self):
        print('машина остановилась')

    def turn(self, duration):
        print(f'машина повернула {duration}')

    def show_speed(self):
        print(f'текущая скорость автомобиля {self.speed} км\ч')


class TownCar(Car):
    def __init__(self, speed, color, name, is_police):
        super().__init__(speed, color, name, is_police)

    def show_speed(self):
        if self.speed > 40:
            print(f'превышение скорости - {self.speed} км\ч')
        else:
            print(f'текущая скорость автомобиля {self.speed} км\ч')


class SportCar(Car):
    def __init__(self, speed, color, name, is_police):
        super().__init__(speed, color, name, is_police)


class WorkCar(Car):
    def __init__(self, speed, color, name, is_police):
        super().__init__(speed, color, name, is_police)

    def show_speed(self):
        if self.speed > 60:
            print(f'превышение скорости - {self.speed} км\ч')
        else:
            print(f'текущая скорость автомобиля {self.speed} км\ч')


class PoliceCar(Car):
    def __init__(self, speed, color, name, is_police):
        super().__init__(speed, color, name, is_police)


tc = TownCar(60, 'black', 'Toyota', False)
sc = SportCar(180, 'yellow', 'Ferrary', False)
wc = WorkCar(80, 'green', 'Ford', False)
pc = PoliceCar(80, 'black-white', 'Dodge', True)

tc.go()
tc.show_speed()
tc.turn('направо')
tc.stop()
print(pc.is_police)
wc.show_speed()
